---
title: CorrectionFactorSet
classe: Autodesk.Revit.DB.Electrical.CorrectionFactorSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CorrectionFactorSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `correctionFactorSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `correctionFactorSet.Size` | Int32 |
| `Void Clear()` | `correctionFactorSet.Clear()` | Void |
| `Boolean Contains(CorrectionFactor)` | `correctionFactorSet.Contains(item)` | Boolean |
| `Int32 Erase(CorrectionFactor)` | `correctionFactorSet.Erase(item)` | Int32 |
| `CorrectionFactorSetIterator ForwardIterator()` | `correctionFactorSet.ForwardIterator()` | CorrectionFactorSetIterator |
| `IEnumerator GetEnumerator()` | `correctionFactorSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(CorrectionFactor)` | `correctionFactorSet.Insert(item)` | Boolean |
| `CorrectionFactorSetIterator ReverseIterator()` | `correctionFactorSet.ReverseIterator()` | CorrectionFactorSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```